<template>
  <div class="container">
    <p>可信链用户注册协议及法律说明：</p>
    <div class="title_notice">
      <p>1、您在申请注册成为可信链（以下简称为：可信）用户的过程中，应当仔细阅读本协议及协议中以粗体并用下划线提示的条款，因为这些条款涉及到您的权利义务，特别是可能会明确您应当履行的义务和对您的权利有一定的限制，请您务必重点、仔细阅读并理解后再行点击同意注册。</p>
      <p>2、当您按照页面提示流程完成注册程序后，即表明您已经过详细阅读、思考并自愿接受本协议的全部内容，成为可信链平台的“用户”。如您不同意或不理解本协议的其中任何一项条款，您应当立即停止注册程序。</p>
    </div>

    <h2>第1条 本站服务条款的确认和接纳</h2>
    <p>1.1本站的各项电子服务的所有权和运作权归可信所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
    <p>1.2用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单等相应的权利能力和行为能力，能够独立承担法律责任。</p>
    <p>1.3如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。</p>
    <p>1.4可信保留在中华人民共和国大陆地区施行法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</p>

    <h2>第2条 本站服务</h2>
    <p>2.1可信通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。</p>
    <p>2.2用户必须自行准备如下设备和承担如下开支：（1）上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。</p>

    <h2>第3条 用户信息</h2>
    <p>3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且可信保留终止用户使用可信各项服务的权利。</p>
    <p>3.2用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</p>
    <p>3.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。</p>
    <p>3.4用户同意，可信拥有通过包括但不限于QQ、微信、短信、电话等形式，向在本站注册、购物用户发送订单信息、促销活动等告知信息的权利。</p>
    <p>3.5用户同意，可信有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p>

    <h2>第4条 用户依法言行义务</h2>
    <p>本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：</p>
    <p>4.1不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
    <p>4.2从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
    <p>4.3不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
    <p>4.4不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；</p>
    <p>4.5不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；</p>
    <p>4.6不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
    <p>4.7不得教唆他人从事本条所禁止的行为；</p>
    <p>4.8不得利用在本站注册的账户进行牟利性经营活动；</p>
    <p>4.9不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。</p>
    <p>本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</p>
    <p>若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。</p>

    <h2>第5条 商品信息</h2>
    <p>
      本站上的商品价格、数量、权益等商品信息随时都有可能发生变动，本站不作特别通知。由于网站上商品信息的数量极其庞大，虽然本站会竭尽全力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解，可信欢迎您的指出和纠错，并会视情况给予纠错者一定的奖励。</p>

    <h2>第6条 订单</h2>
    <p>6.1在您下订单时，请您仔细确认所购商品的名称、价格、数量、权益等信息。购买人与使用者不一致的，购买人的行为和意思表示视为用户的行为和意思表示，用户应对购买人的行为及意思表示的法律后果承担连带责任。</p>
    <p>
      6.2除法律另有强制性规定外，双方约定如下：本站上销售方展示的商品和价格等信息仅仅是交易信息的发布，您购买下订单之前，请联系在线客服核实该商品的相关数据情况等，由于市场变化及各种以合理商业努力难以控制的因素的影响，本站无法保证您提交的订单信息中希望购买的商品都会有货；如您拟购买的商品，发生缺货，您有权取消订单。</p>

    <h2>第7条 所有权及知识产权条款</h2>
    <p>
      7.1用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给可信所有，用户同意可信有权就任何主体侵权而单独提起诉讼。</p>
    <p>7.2本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在可信网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
    <p>7.3可信拥有此网站内容及资源的合法权利,受国家法律保护,有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的限度范围内，可信对本协议及本站内容拥有解释权。</p>
    <p>7.4除法律另有强制性规定外，未经可信明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，可信有权追究其法律责任。</p>
    <p>
      7.5本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、数据编辑和软件），均是可信或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是可信的排他财产，受中国和国际版权法的保护。本站上所有软件都是可信或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>

    <h2>第8条 协议更新及用户关注义务</h2>
    <p>
      根据国家法律法规变化及网站运营需要，可信有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅现有的协议；用户有义务不时关注并阅读现有的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受可信网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。可信建议您在使用本站之前阅读本协议及本站的公告。如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>

    <h2>第9条 法律管辖和适用</h2>
    <p>
      本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，均由可信所属公司之所在城市地区人民法院提起诉讼申请。</p>

    <h2>第10条 其他</h2>
    <p>10.1可信网站所有者是指在政府部门依法许可或备案的可信网站经营主体。</p>
    <p>10.2可信尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，可信将虚心接受并适时修改本协议及本站上的各类规则。</p>
    <p>10.3本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</p>
    <p>10.4您点击本协议下方的;同意并继续;按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>

  </div>
</template>

<script>
  export default {
    name: "contract",
    components: {},
    data() {
      return {}
    },
    created() {
    },
    mounted() {
    },
    watch: {},
    computed: {},
    methods: {},
  }
</script>

<style scoped>
  .container {
    padding: 20px 50px;
    line-height: 25px;
    background-color: #ffffff;
    padding-bottom: 50px;
  }

  h2 {
    font-size: 16px;
    font-weight: 700;
    margin: 4px 0;
  }

  .title_notice {
    font-weight: bold;
    font-size: 20px;
    line-height: 30px;
    margin-top: 4px;
  }
</style>
